<?php
	$name = "osdev.jp";
	$author = "osdev.jp members";
	$title_website = "osdev.jp - 日本のOS開発コミュニティ";
	$title_page = "テンプレートページ";
	$description = "osdev.jpはOS開発に有用な情報を収集し公開しています。";
	$keywords = "";
?>
<?xml version="1.0" encoding="UTF-8" ?>
<!DOCTYPE html>
<html xmlns="http://www.w3.org/1999/xhtml" lang="ja-JP">
	<head>
		<meta charset="UTF-8">
		<title><?php echo $title_page ?> | <?php echo $title_website ?></title>
		<meta name="application-name" content="<?php echo $name ?>" />
		<meta name="author" content="<?php echo $author ?>">
		<meta name="description" content="<?php echo $description ?>" />
		<meta name="generator" content="Blacool Style TEMPLATE.PHP">
		<meta name="keywords" content="<?php echo $keywords ?>" />
		<link rel="stylesheet" href="./blacool.css" type="text/css" />
	</head>
	<body>
		<div id="container">
			<!-- ヘッダー開始 -->
			<header>
				<h1 id="top"><?php echo $title_website ?></h1>
				<p><?php echo $description ?></p>
			</header>
			<!-- ヘッダー終了 -->

			<!-- メインコンテンツ 開始 -->
			<div id="main">

				<!-- 本文開始 -->
				<section class="main">
					<h1><?php echo $title_page ?></h1>
					<!-- 記事 (例) -->
					<article id="contents">
						<h2>見出し</h2>
						<p>
							内容をここに挿入。内容をここに挿入。内容をここに挿入。
							内容をここに挿入。内容をここに挿入。内容をここに挿入。
							内容をここに挿入。内容をここに挿入。内容をここに挿入。
							内容をここに挿入。内容をここに挿入。内容をここに挿入。
							内容をここに挿入。内容をここに挿入。内容をここに挿入。
							内容をここに挿入。内容をここに挿入。内容をここに挿入。
							内容をここに挿入。内容をここに挿入。内容をここに挿入。
							内容をここに挿入。内容をここに挿入。内容をここに挿入。
							内容をここに挿入。内容をここに挿入。内容をここに挿入。
							内容をここに挿入。内容をここに挿入。内容をここに挿入。
							内容をここに挿入。内容をここに挿入。内容をここに挿入。
							内容をここに挿入。内容をここに挿入。内容をここに挿入。
						</p>
					</article>
					<!-- 記事 (例) -->
					<article id="contents">
						<h2>見出し</h2>
						<p>
							内容をここに挿入。内容をここに挿入。内容をここに挿入。
							内容をここに挿入。内容をここに挿入。内容をここに挿入。
							内容をここに挿入。内容をここに挿入。内容をここに挿入。
							内容をここに挿入。内容をここに挿入。内容をここに挿入。
							内容をここに挿入。内容をここに挿入。内容をここに挿入。
							内容をここに挿入。内容をここに挿入。内容をここに挿入。
							内容をここに挿入。内容をここに挿入。内容をここに挿入。
							内容をここに挿入。内容をここに挿入。内容をここに挿入。
							内容をここに挿入。内容をここに挿入。内容をここに挿入。
							内容をここに挿入。内容をここに挿入。内容をここに挿入。
							内容をここに挿入。内容をここに挿入。内容をここに挿入。
							内容をここに挿入。内容をここに挿入。内容をここに挿入。
						</p>
					</article>
					<!-- 記事 (例) -->
					<article id="contents">
						<h2>見出し</h2>
						<p>
							内容をここに挿入。内容をここに挿入。内容をここに挿入。
							内容をここに挿入。内容をここに挿入。内容をここに挿入。
							内容をここに挿入。内容をここに挿入。内容をここに挿入。
							内容をここに挿入。内容をここに挿入。内容をここに挿入。
							内容をここに挿入。内容をここに挿入。内容をここに挿入。
							内容をここに挿入。内容をここに挿入。内容をここに挿入。
							内容をここに挿入。内容をここに挿入。内容をここに挿入。
							内容をここに挿入。内容をここに挿入。内容をここに挿入。
							内容をここに挿入。内容をここに挿入。内容をここに挿入。
							内容をここに挿入。内容をここに挿入。内容をここに挿入。
							内容をここに挿入。内容をここに挿入。内容をここに挿入。
							内容をここに挿入。内容をここに挿入。内容をここに挿入。
						</p>
					</article>
				</section>
				<!-- 本文終了 -->

				<!-- サイドバー開始 -->
				<nav>
					<!-- 記事 (例) -->
					<article id="contents">
						<h2>見出し</h2>
						<p>
							内容をここに挿入。内容をここに挿入。内容をここに挿入。
							内容をここに挿入。内容をここに挿入。内容をここに挿入。
							内容をここに挿入。内容をここに挿入。内容をここに挿入。
							内容をここに挿入。内容をここに挿入。内容をここに挿入。
							内容をここに挿入。内容をここに挿入。内容をここに挿入。
							内容をここに挿入。内容をここに挿入。内容をここに挿入。
							内容をここに挿入。内容をここに挿入。内容をここに挿入。
							内容をここに挿入。内容をここに挿入。内容をここに挿入。
							内容をここに挿入。内容をここに挿入。内容をここに挿入。
							内容をここに挿入。内容をここに挿入。内容をここに挿入。
							内容をここに挿入。内容をここに挿入。内容をここに挿入。
							内容をここに挿入。内容をここに挿入。内容をここに挿入。
						</p>
					</article>
					<!-- 記事 (例) -->
					<article id="contents">
						<h2>見出し</h2>
						<p>
							内容をここに挿入。内容をここに挿入。内容をここに挿入。
							内容をここに挿入。内容をここに挿入。内容をここに挿入。
							内容をここに挿入。内容をここに挿入。内容をここに挿入。
							内容をここに挿入。内容をここに挿入。内容をここに挿入。
							内容をここに挿入。内容をここに挿入。内容をここに挿入。
							内容をここに挿入。内容をここに挿入。内容をここに挿入。
							内容をここに挿入。内容をここに挿入。内容をここに挿入。
							内容をここに挿入。内容をここに挿入。内容をここに挿入。
							内容をここに挿入。内容をここに挿入。内容をここに挿入。
							内容をここに挿入。内容をここに挿入。内容をここに挿入。
							内容をここに挿入。内容をここに挿入。内容をここに挿入。
							内容をここに挿入。内容をここに挿入。内容をここに挿入。
						</p>
					</article>
					<!-- 記事 (例) -->
					<article id="contents">
						<h2>見出し</h2>
						<p>
							内容をここに挿入。内容をここに挿入。内容をここに挿入。
							内容をここに挿入。内容をここに挿入。内容をここに挿入。
							内容をここに挿入。内容をここに挿入。内容をここに挿入。
							内容をここに挿入。内容をここに挿入。内容をここに挿入。
							内容をここに挿入。内容をここに挿入。内容をここに挿入。
							内容をここに挿入。内容をここに挿入。内容をここに挿入。
							内容をここに挿入。内容をここに挿入。内容をここに挿入。
							内容をここに挿入。内容をここに挿入。内容をここに挿入。
							内容をここに挿入。内容をここに挿入。内容をここに挿入。
							内容をここに挿入。内容をここに挿入。内容をここに挿入。
							内容をここに挿入。内容をここに挿入。内容をここに挿入。
							内容をここに挿入。内容をここに挿入。内容をここに挿入。
						</p>
					</article>
				</nav>
				<!-- サイドバー終了 -->

			</div>
			<!-- メインコンテンツ 終了 -->

			<!-- フッター開始 -->
			<footer>
				<small>Community: <?php echo $author ?></small><br />
				<small>Website: Copytight (C) 2018 Takym.</small>
			</footer>
			<!-- フッター終了 -->
		</div>
	</body>
</html>
